app/views/posts/new.html.erb

    <%= f.label :topic %>
    <%= f.collection_select :topic_title, Topic.all, :title, :title %>
---
SELECT "topics".* FROM "topics"