app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
    def index
        if params[:post_id] && @post = Post.find_by_id(params[:post_id])
            @comments = @post.comments
        else
            @error = "That post doesn't exist yet!" if params[:post_id]
            @comments = Comment.all