app/controllers/posts_controller.rb

    def post_params
      params.require(:post).permit(:title, :body, :user_id, :topic_id, :post_id, :topic)
      @topic_id = Topic.find_by(title: params[:title])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."title" IS NULL LIMIT $1  [["LIMIT", 1]]