app/controllers/topics_controller.rb

INSERT INTO "topics" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "fish scales"], ["created_at", "2021-06-27 06:47:22.415231"], ["updated_at", "2021-06-27 06:47:22.415231"]]
---
      def create
        @topic = Topic.new(topic_params)
        if @topic.save

SELECT "topics".* FROM "topics"
---
    def show
      @topics = Topic.all